<a href="https://colab.research.google.com/github/trijuhari/Data_science/blob/master/Code_Challenge_Queries.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Code Challenge: Queries**
LESSON
Practice basic SQL query commands.

## **Baby Names Introduction**
Welcome to Code Challenge: Queries!

In this Code Challenge, you will be querying data from three different datasets:

* Baby Names
* Restaurants
*  News Headlines


In the first one, you will be performing analysis on U.S. baby names.

You’ll start with a table named babies with four columns.

Thank you SSA for the data.


![alt text](https://content.codecademy.com/courses/updated_images/SQLbabiesdiagram_Updated_1-01.svg)

## **Code Challenge 1**
The babies table has the following columns:

* name - the name of the baby
* year - the year the name was given
* gender - the gender of the baby
* number - the number of times the name was given
Click here for the table diagram.

Instructions
1.
Find the number of girls who were named Lillian for the full span of time of the database.

Select only the year and number columns.


    select year, number  from babies where name= 'Lillian' ;

## **Code Challenge 2**
The babies table has the following columns:

* name - the name of the baby
* year - the year the name was given
* gender - the gender of the baby
* number - the number of times the name was given
Click here for the table diagram.

Instructions
1.
Find 20 distinct names that start with ‘S’.

Select only the name column


    SELECT DISTINCT name
    FROM babies
    WHERE name LIKE 'S%' LIMIT 20;

## **Code Challenge 3**
The babies table has the following columns:

* name - the name of the baby
* year - the year the name was given
* gender - the gender of the baby
* number - the number of times the name was given


Click here for the table diagram.

Instructions
1.
    What are the top 10 names in 1880?

    Select the name, gender, and number columns.

 
First, we need to specify the year using a WHERE clause:

    SELECT name, gender, number
    FROM babies
    WHERE year = 1880;


Then, we need to ORDER BY the number of times that name was given. We also need to add DESC so that we start with the most popular names:

    SELECT name, gender, number
    FROM babies
    WHERE year = 1880
    ORDER BY number DESC;
Finally, we need to limit our results to the first 10 results:

    SELECT name, gender, number
    FROM babies
    WHERE year = 1880
    ORDER BY number DESC
    LIMIT 10;

## **Restaurants Introduction**
Next up, you will be querying data on restaurants:

* Baby Names
* Restaurants
* News Headlines

We need your help to answer some questions and find the best dinner spots in the city!

You’ll work with a table named nomnom with six columns.

![alt text](https://content.codecademy.com/courses/updated_images/Nomnom_Updated_1.svg)

## **Code Challenge 4**
The nomnom table has the following columns:

* name - the restaurant name
* neighborhood - the neighborhood name
*  cuisine - the cuisine type
* review - the average user review
* price - the price range
* health - the health inspection grade

Click here for the table diagram.

Instructions
1.
Suppose your friend Jaime wants to go out to Japanese, but you’re on a budget.

Return all the restaurants that are Japanese and $$.

Select all the columns.

    SELECT * FROM nomnom where  cuisine  ="Japanese" AND price ='$$';

## **Code Challenge 5**
The nomnom table has the following columns:

* name - the restaurant name
* neighborhood - the neighborhood name
*  cuisine - the cuisine type
* review - the average user review
* price - the price range
* health - the health inspection grade


Click here for the table diagram.

Instructions
1.
Your roommate Bevers can’t remember the exact name of a restaurant he went to but he knows it contains the word ‘noodle’ in it.

Can you find it for him using a query?

% is a wildcard character that matches zero or more missing letters in the pattern.

To find the restaurant names that contain the word ‘noodle’:

    SELECT ___
    FROM _____
    WHERE name LIKE '%noodle%';

Select all the columns.

    SELECT * FROM nomnom WHERE name like '%noodle%';

## **Code Challenge 6
The nomnom table has the following columns:
 

Instructions
1.
Some of the restaurants have not been inspected yet or are currently appealing their health grade score.

Find the restaurants that have empty health values.

Select all the columns.


    select * from nomnom where  health is null;

## **News Headlines Introduction**

Here is the last dataset of the Code Challenge #1:

* Baby Names
* Restaurants
* News Headlines


There is a table called news with six columns.

It is full of news article headlines from different publishing companies!

![alt text](https://content.codecademy.com/courses/updated_images/SQL_Intensive_NewsDiagram_Updated_1.svg)

## **Code Challenge 7**


The news table has the following columns:

* id - the article identifier
* title - the article title
* publisher - the article publisher
* category - the article category
* timestamp - the time of publication
* url - the article web address

Click here for the table diagram.

Instructions
1.
Order the table by title (from A-Z).

Select only the title and publisher columns.


    SELECT title, publisher FROM news ORDER BY title asc

## **Code Challenge 8**
The news table has the following columns:


Instructions
1.
Which article names have the word 'bitcoin' in it?

Select all the columns.

    SELECT * FROM news  WHERE title  LIKE '%bitcoin%'

## **Code Challenge 9**
The news table has the following columns:


Instructions
1.
The category column contains the article category:

'b' stands for Business
't' stands for Technology
What are the 20 business articles published most recently?

Select all the columns.

      SELECT  * FROM news  WHERE category ='b' ORDER BY timestamp DESC LIMIT 20;

## **The End**
 
Feel free to experiment more with all three tables. For example:

Is your name in babies?
* How many babies were given your name?
* What are the top 5 restaurants in nomnom?
* What are the top 5 Chinese restaurants?
* Which articles are from Wall Street Journal in news?
* Which technology articles are from Wall Street Journal?